//Розроблена програма має опрацьовувати вже існуючий файл, створений за допомогою
//текстового редактора.
//Опрацювання файлів слід виконувати у функціях, які всю інформацію приймають у
//вигляді параметрів.Використовувати нелокальні змінні не можна.
//Кожна функція має виконувати лише одну роль, і ця роль має бути відображена у
//назві функції.
//«Функція, яка повертає / обчислює / шукає ...» – має не виводити ці значення, а
//повернути їх у місце виклику як результат функції або як відповідний вихідний параметр.

//Варіант 9.
//Дано текстовий файл t.
//Вияснити, чи є в цьому файлі четвірка сусідніх однакових символів(оформити у
//    вигляді функції).

#include <iostream>
#include <fstream>
#include <string>
#include <Windows.h>

using namespace std;

int Count();

int main()
{
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);

    cout << "Кількість слів в ких 4 символи поспіль в файлі text.txt: " << Count() << endl;
    return 0;
}
int Count()
{
    ifstream t("text.txt");
    string s;

    int k = 0;

    while (getline(t, s))
    {
        for (int i = 0; i < s.length(); i++)
        {
            if (s[i] == s[i + 1] &&
                s[i] == s[i + 2] &&
                s[i] == s[i + 3])
            {
                k++;
            }
        }
    }
    return k;
}
